#pragma once
#include <glm/glm.hpp>
#include <vector>

namespace primitive
{
	// 図形データの作成
	const std::vector<glm::dvec3> RegelarOctohedron{
		{  0.0,  1.0,  0.0 },
		{ -1.0,  0.0,  0.0 },
		{  0.0, -1.0,  0.0 },
		{  1.0,  0.0,  0.0 },
		{  0.0,  1.0,  0.0 },
		{  0.0,  0.0,  1.0 },
		{  0.0, -1.0,  0.0 },
		{  0.0,  0.0, -1.0 },
		{ -1.0,  0.0,  0.0 },
		{  0.0,  0.0,  1.0 },
		{  1.0,  0.0,  0.0 },
		{  0.0,  0.0, -1.0 }
	};
	const std::vector<glm::dvec3> axes{
		{  0.0,  0.0,  0.0 },
		{  1.0,  0.0,  0.0 },
		{  0.0,  0.0,  0.0 },
		{  0.0,  1.0,  0.0 },
		{  0.0,  0.0,  0.0 },
		{  0.0,  0.0,  1.0 },
		{  0.0,  0.0,  0.0 }
	};
	const std::vector<glm::dvec3> Square{
		{ -1.0, -1.0, 0.0 },
		{ -1.0,  1.0, 0.0 },
		{  1.0,  1.0, 0.0 },
		{  1.0, -1.0, 0.0 },
	};
	const std::vector<glm::dvec3> Triangle{
		{ -0.1, -0.1, 0.0 },
		{  0.0,  0.1, 0.0 },
		{  0.1, -0.1, 0.0 },
	};
}